# Aggregation & Grouping

Grouping and aggregating helps you to summerize the data - like answering

### .groupby() function

df.groupby() is used to group rows of a DataFrame based on the values in one or more columns, which allows you to then perform aggregate functions.

In [ ]:
import pandas as pd

df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "B", "B", "C", "C", "D", "D", "E"],  # Fixed: was missing one value
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 95, 80, 88, 92, 91, 60],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-18", "2020-02-15", "2021-03-20", "2021-04-16",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

df

In [ ]:
df.groupby("Department")['Salary'].mean()

In [ ]:
df.groupby("Team")['Salary'].sum()

In [ ]:
# .agg() allows us to perform multiple aggregations at once and also gives us the flexibility to name the resulting columns.
# .agg() and .aggregate() are essentially the same method, and you can use either one. The .agg() method is just a shorter alias for .aggregate().
df.groupby("Gender")['Salary'].agg(['mean', 'sum', 'count', 'min', 'max'])

In [11]:
df.groupby("Department")['Salary'].agg(avg_salary='mean', total_salary='sum', count='count', min_salary='min', max_salary='max')

            avg_salary  total_salary  count  min_salary  max_salary
Department
HR                87.5           175      2          85          90
IT                87.5           175      2          80          95
Marketing         90.0           180      2          88          92
Sales             75.5           151      2          60          91

In [ ]:
# We can also use .transform() to create new columns based on group-level calculations. For example, we can calculate the average salary for each team and add it as a new column to the original DataFrame.
df['Team_avg_Salary'] = df.groupby('Team')['Salary'].transform('mean')
df

  Department Team Gender  Salary  Age   JoinDate  Team_avg_Salary
0         HR    A      M      85   23 2020-01-18             85.0
1         HR    B      F      90   25 2020-02-15             92.5
2         IT    B      M      95   30 2021-03-20             92.5
3         IT    C      F      80   22 2021-04-16             84.0
4  Marketing    C      M      88   28 2020-05-30             84.0
5  Marketing    D      F      92   26 2020-06-25             91.5
6      Sales    D      M      91   21 2021-07-15             91.5
7      Sales    E      F      60   27 2021-08-01             60.0

In [16]:
# filter() is used to filter groups based on a condition. It returns a DataFrame that contains only the groups that satisfy the condition. For example, we can filter teams that have an average salary greater than 90.
high_salary_teams = df.groupby('Team').filter(lambda x: x['Salary'].mean() > 90)
high_salary_teams

  Department Team Gender  Salary  Age   JoinDate  Team_avg_Salary
1         HR    B      F      90   25 2020-02-15             92.5
2         IT    B      M      95   30 2021-03-20             92.5
5  Marketing    D      F      92   26 2020-06-25             91.5
6      Sales    D      M      91   21 2021-07-15             91.5